# Insert Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IntersectionResultArray..::..Insert Method
IntersectionResultArray Class See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Insert(
	IntersectionResult item,
	int index
)
```

Visual Basic
---
```text
Public Overridable Sub Insert ( _
	item As IntersectionResult, _
	index As Integer _
)
```

Visual C++
---
```text
public:
virtual void Insert(
	IntersectionResult^ item,
	int index
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..IntersectionResult
index
    Type: System..::..Int32
# See Also
IntersectionResultArray Class
Autodesk.Revit.DB Namespace